In [1]:
import mysql.connector as conn

In [2]:
mydb=conn.connect(host="localhost", user="root", password="r@shika123")

In [3]:
cursor=mydb.cursor()

In [4]:
cursor.execute("use organisation")

# Q-1. Write an SQL query to determine the 5th highest salary without using TOP or limit method.

In [5]:
import pandas as pd
pd.read_sql('select * from organisation.employee',mydb)

   emp_id       Name      Address  Salary      City
0      10  Ranjana D     JP NAGAR  158800  Ayrshire
1      10  Ranjana D     JP NAGAR  158800  Ayrshire
2      10  Ranjana D     JP NAGAR  158800     Ayrsh
3      11    Rohit k  KAMLA NAGAR  158000    Azalea
4      12     Rupa G     OP NAGAR  258000      Azle
5      13    Rishi P     GT NAGAR  358000     Aztec
6      14     Raju D    GTB NAGAR  458000     Azure
7      15    Reena D     MG NAGAR  558000     Azusa

In [6]:
cursor.execute("select salary from employee e1 where 4=(select count(distinct(e2.salary)) from employee e2 where e2.salary>=e1.salary)")

In [7]:
cursor.fetchall()

[(258000,)]

# Q-2. Write an SQL query to fetch the list of employees with the same salary.

In [8]:
#cursor.execute(" select distinct e.Name, e.Salary from employee e, employee e1 where e.salary=e1.salary and e.Name!=e1.Name")

In [9]:
cursor.execute("select name, salary from employee")

In [10]:
cursor.fetchall()

[('Ranjana D', 158800),
 ('Ranjana D', 158800),
 ('Ranjana D', 158800),
 ('Rohit k', 158000),
 ('Rupa G', 258000),
 ('Rishi P', 358000),
 ('Raju D', 458000),
 ('Reena D', 558000)]

                             Keep Learning, Keep Growing...